-- phpMyAdmin SQL Dump
-- version 4.4.12
-- http://www.phpmyadmin.net
--
-- Host: 127.0.0.1
-- Generation Time: 2017-07-13 03:31:41
-- 服务器版本： 5.6.25
-- PHP Version: 5.6.11

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `book`
--

-- --------------------------------------------------------

--
-- 表的结构 `book`
--

CREATE TABLE IF NOT EXISTS `book` (
  `id` int(6) NOT NULL,
  `title` varchar(100) NOT NULL,
  `author` varchar(100) NOT NULL,
  `publisher` varchar(50) NOT NULL,
  `publish_year` year(4) NOT NULL,
  `total` int(3) NOT NULL,
  `leave_number` int(3) NOT NULL,
  `storage_time` varchar(100) NOT NULL,
  `other` text
) ENGINE=InnoDB AUTO_INCREMENT=70 DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `book`
--

INSERT INTO `book` (`id`, `title`, `author`, `publisher`, `publish_year`, `total`, `leave_number`, `storage_time`, `other`) VALUES
(1, '互联网企业安全高级指南', '赵彦，江虎，胡乾威 著', '机械工业出版社', 2018, 1, 1, '2017-07-12 06:42:29', ''),
(2, '黑客大曝光：无线网络安全', '乔舒亚·莱特（Joshua Wright）约翰著；李瑞民 译', '机械工业出版社', 2018, 1, 1, '2017-07-12 06:43:15', ''),
(3, '物联网设备安全', '[美] 尼特什·汉加尼 著；林林，陈煜，龚娅君 译', '机械工业出版社', 2018, 1, 1, '2017-07-12 06:43:32', ''),
(4, 'Rootkit隐遁攻击技术及其防范', '张瑜(著)', '电子工业出版社 ', 2018, 1, 1, '2017-07-12 06:43:47', ''),
(5, 'Rootkits and Bootkits', 'Alex Matrosov, Eugene Rodionov, and Sergey Bratus', 'nostarch出版', 2018, 1, 1, '2017-07-12 06:44:03', ''),
(6, 'PoC||GTFO', '空', 'nostarch出版', 2018, 1, 1, '2017-07-12 06:46:22', ''),
(7, 'WEB应用安全权威指南', '徳丸浩著，刘文，刘斌译 ', '人民邮电出版社', 2018, 1, 1, '2017-07-12 06:46:39', ''),
(8, '黑客秘笈 渗透测试实用指南', '皮特，基姆（Peter Kim）', '人民邮电出版社', 2018, 1, 1, '2017-07-12 06:46:59', ''),
(9, '代码审计-企业级web代码安全架构', '尹毅', '机械工业出版社', 2018, 1, 1, '2017-07-12 06:47:12', ''),
(10, 'Namp渗透测试指南', '商广明', '人民邮电出版社', 2018, 1, 1, '2017-07-12 06:47:25', ''),
(11, '网站渗透测试实战入门', '陈明照', '机械工业出版社', 2018, 1, 1, '2017-07-12 06:47:39', ''),
(12, '黑客攻防技术宝典-Web实战篇(第二版)', '石华耀', '人民邮电出版社', 2018, 1, 1, '2017-07-12 06:47:51', ''),
(13, 'Metasploit渗透测试魔鬼训练营', '诸葛建伟，陈力波，田繁 等 著', '机械工业出版社', 2018, 1, 1, '2017-07-12 06:48:07', ''),
(14, '逆向工程权威指南（上册）', 'Dennis，Yurichev，丹尼斯 著；Archer，安天安全研究与应急处理中心 译', '人民邮电出版社 ', 2018, 1, 1, '2017-07-12 06:48:49', ''),
(15, '逆向工程权威指南（下册）', 'Dennis，Yurichev，丹尼斯 著；Archer，安天安全研究与应急处理中心 译', '人民邮电出版社 ', 2018, 1, 1, '2017-07-12 06:49:10', ''),
(16, '图解密码技术 第三版', '[日] 结城浩 著；周自恒 译', '人民邮电出版社 ', 2018, 1, 1, '2017-07-12 06:49:30', ''),
(17, '图解HTTP', '[日] 上野宣 著；于均良 译', '人民邮电出版社 ', 2018, 1, 1, '2017-07-12 06:49:46', ''),
(18, '图解TCP/IP(第5版) ', '竹下隆史等', '人民邮电出版社 ', 2018, 1, 1, '2017-07-12 06:50:03', ''),
(19, 'JavaScript基础教程（第9版）', '(美)Dori Smith Tom Negrino   ', '人民邮电出版社', 2018, 1, 1, '2017-07-12 06:50:22', ''),
(20, '学习之道', '（美）芭芭拉·奥克利（Barbara Oakley）', '机械工业出版社', 2018, 1, 1, '2017-07-12 06:51:48', ''),
(21, '刻意练习', '（美） 安德斯·艾利克森、罗比特·普尔著', '机械工业出版社', 2018, 1, 1, '2017-07-12 06:52:07', ''),
(22, '练习的心态', '（美）托马斯 M.斯特纳', '机械工业出版社', 2018, 1, 1, '2017-07-12 06:52:22', ''),
(23, '如何高效记忆', '（美）肯尼思·希格比（Kenneth L. Higbee）', '机械工业出版社', 2018, 1, 1, '2017-07-12 06:52:41', ''),
(24, '如何成为一个学习忍者 ', '（英）格雷厄姆·奥尔科特（Graham Allcott）   ', '机械工业出版社', 2018, 1, 1, '2017-07-12 06:53:04', ''),
(25, '架构真经', '马丁 L.阿伯特（Martin L.Abbott），迈克尔 T.费舍尔（Michael T.Fisher）', '机械工业出版社', 2018, 1, 1, '2017-07-12 06:54:34', ''),
(26, '浪潮之巅（上册）', '吴军', '人民邮电出版社', 2018, 1, 1, '2017-07-12 06:55:09', ''),
(27, '浪潮之巅（下册）', '吴军', '人民邮电出版社', 2018, 1, 1, '2017-07-12 06:55:28', ''),
(28, '云计算架构技术与实践', '顾炯炯 ', '清华大学出版社', 2018, 1, 1, '2017-07-12 06:55:45', ''),
(29, '精通正则表达式', 'Jeffrey E.F.Friedl 著；余晟 译', '电子工业出版社', 2018, 1, 1, '2017-07-12 07:00:25', ''),
(30, '计算机程序设计艺术 卷1：基本算法(第3版)(精装)', '(美)高德纳（Donald E. Knuth）   ', '人民邮电出版社', 2018, 1, 1, '2017-07-12 07:00:41', ''),
(31, '计算机程序设计艺术 卷2 半数值算法 第3版', '(美)高德纳（Donald E. Knuth）   ', '人民邮电出版社', 2018, 1, 1, '2017-07-12 07:00:54', ''),
(32, '计算机程序设计艺术 卷3：排序与查找（第2版）', '(美)高德纳（Donald E. Knuth）   ', '人民邮电出版社', 2018, 1, 1, '2017-07-12 07:01:07', ''),
(33, '大话存储：存储系统底层架构原理极限剖析（终极版）', '张冬', ' 清华大学出版社', 2018, 1, 1, '2017-07-12 07:01:20', ''),
(34, '大话存储后传：次世代数据存储思维与技术 ', '冬瓜哥 ', ' 清华大学出版社', 2018, 1, 1, '2017-07-12 07:01:34', ''),
(35, 'Docker 容器与容器云（第2版） ', '浙江大学SEL实验室 ', ' 人民邮电出版社 ', 2018, 1, 1, '2017-07-12 07:01:48', ''),
(36, 'Kubernetes权威指南：从Docker到Kubernetes实践全接触（第2版） ', '龚正，吴治辉，王伟 等 ', ' 电子工业出版社', 2018, 1, 1, '2017-07-12 07:02:01', ''),
(37, 'Hadoop权威指南（第3版 修订版） ', '[美] Tom White 著', ' 清华大学出版社', 2018, 1, 1, '2017-07-12 07:02:14', ''),
(38, 'Linux内核设计的艺术：图解Linux操作系统架构设计与实现理（第2版', '新设计团队 编', '机械工业出版社', 2018, 1, 1, '2017-07-12 07:02:25', ''),
(39, 'Python学习手册', '[美] 鲁特兹（Mark Lutz） 著；李军 等 译', '机械工业出版社', 2018, 1, 1, '2017-07-12 07:02:39', ''),
(40, '图说天下之传说时代 夏 商 西周', '龚书铎，刘德麟 编', '北京联合出版公司', 2017, 1, 1, '2017-07-13 03:12:50', ''),
(41, '图说天下之春秋 战国', '龚书铎，刘德麟 编', '北京联合出版公司', 2017, 1, 1, '2017-07-13 03:13:46', ''),
(42, '图说天下之秦汉', '龚书铎，刘德麟 编', '北京联合出版公司', 2017, 1, 1, '2017-07-13 03:14:51', ''),
(43, '图说天下之三国 两晋 南北朝', '龚书铎，刘德麟 编', '北京联合出版公司', 2017, 1, 1, '2017-07-13 03:15:45', ''),
(44, '图说天下之隋唐 五代', '龚书铎，刘德麟 编', '北京联合出版公司', 2017, 1, 1, '2017-07-13 03:17:12', ''),
(45, '图说天下之辽 西夏 金', '龚书铎，刘德麟 编', '北京联合出版公司', 2017, 1, 1, '2017-07-13 03:19:07', ''),
(46, '图说天下之宋', '龚书铎，刘德麟 编', '北京联合出版公司', 2017, 1, 1, '2017-07-13 03:19:44', ''),
(47, '图说天下之元', '龚书铎，刘德麟 编', '北京联合出版公司', 2017, 1, 1, '2017-07-13 03:20:07', ''),
(48, '图说天下之明', '龚书铎，刘德麟 编', '北京联合出版公司', 2017, 1, 1, '2017-07-13 03:20:23', ''),
(49, '图说天下之清', '龚书铎，刘德麟 编', '北京联合出版公司', 2017, 1, 1, '2017-07-13 03:20:41', ''),
(50, '全球通史1人类的文明', '郭方 编', '北京联合出版公司', 2015, 1, 1, '2017-07-13 03:22:25', ''),
(51, '全球通史2帝国时代', '郭方 编', '北京联合出版公司', 2015, 1, 1, '2017-07-13 03:22:44', ''),
(52, '全球通史3征服与扩张', '郭方 编', '北京联合出版公司', 2015, 1, 1, '2017-07-13 03:23:12', ''),
(53, '全球通史4中古时代', '郭方 编', '北京联合出版公司', 2015, 1, 1, '2017-07-13 03:23:35', ''),
(54, '全球通史5欧洲的转折', '郭方 编', '北京联合出版公司', 2015, 1, 1, '2017-07-13 03:23:58', ''),
(55, '全球通史6君王权威', '郭方 编', '北京联合出版公司', 2015, 1, 1, '2017-07-13 03:24:17', ''),
(56, '全球通史7革命浪潮', '郭方 编', '北京联合出版公司', 2015, 1, 1, '2017-07-13 03:24:38', ''),
(57, '全球通史8殖民争霸', '郭方 编', '北京联合出版公司', 2015, 1, 1, '2017-07-13 03:25:05', ''),
(58, '全球通史9两战风云', '郭方 编', '北京联合出版公司', 2015, 1, 1, '2017-07-13 03:25:31', ''),
(59, '全球通史10世界新格局', '郭方 编', '北京联合出版公司', 2015, 1, 1, '2017-07-13 03:25:49', ''),
(60, 'Android恶意代码分析与渗透测试', '（韩）赵涏元', '人民邮电出版社', 2017, 1, 1, '2017-07-13 03:26:09', ''),
(61, 'Android软件安全与逆向分析', '丰生强', '人民邮电出版社', 2017, 1, 1, '2017-07-13 03:26:21', ''),
(62, 'Android安全攻防实战', '崔孝晨;武晓音', '电子工业出版社', 2017, 1, 1, '2017-07-13 03:26:33', ''),
(63, '运维前线', '云技术社区 著', '机械工业出版社', 2017, 1, 1, '2017-07-13 03:26:49', ''),
(64, 'Linux命令行与shell脚本编程大全', '[美] 布鲁姆（Richard Blum），布雷斯纳汉（Christine Bresnahan） 著；门佳，武海峰 译', '人民邮电出版社', 2017, 1, 1, '2017-07-13 03:27:06', ''),
(65, 'Linux集群和自动化运维', '余洪春(著)', '机械工业出版社', 2017, 1, 1, '2017-07-13 03:27:19', ''),
(66, 'Oracle DBA工作笔记：运维、数据迁移与性能调优', '杨建荣', ' 中国铁道出版社 ', 2017, 1, 1, '2017-07-13 03:27:31', ''),
(67, '大话OracleGrid：云时代的RAC', '张晓明 ', ' 人民邮电出版社 ', 2017, 1, 1, '2017-07-13 03:27:42', ''),
(68, 'ELK Stack权威指南（第2版）', '饶琛琳 著', '机械工业出版社', 2017, 1, 1, '2017-07-13 03:27:54', ''),
(69, 'VMware vSphere 6.0虚拟化架构实战指南', '何坤源 著', ' 人民邮电出版社 ', 2017, 1, 1, '2017-07-13 03:28:06', '');

-- --------------------------------------------------------

--
-- 表的结构 `lend`
--

CREATE TABLE IF NOT EXISTS `lend` (
  `id` int(6) NOT NULL,
  `book_id` int(6) NOT NULL,
  `book_title` varchar(100) NOT NULL,
  `user_name` varchar(100) NOT NULL,
  `lend_time` varchar(100) default '未归还'
) character set = utf8;

-- --------------------------------------------------------

--
-- 表的结构 `lend_log`
--

CREATE TABLE IF NOT EXISTS `lend_log` (
  `id` int(8) NOT NULL,
  `book_id` int(6) NOT NULL,
  `book_title` varchar(100) NOT NULL,
  `user_name` varchar(100) NOT NULL,
  `lend_time` date NOT NULL,
  `return_time` varchar(100) NOT NULL
) character set = utf8;

-- --------------------------------------------------------

--
-- 表的结构 `user`
--

CREATE TABLE IF NOT EXISTS `user` (
  `id` int(3) NOT NULL,
  `name` varchar(20) NOT NULL,
  `password` varchar(50) NOT NULL
) character set = utf8;

--
-- Indexes for dumped tables
--

--
-- Indexes for table `book`
--
ALTER TABLE `book`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `lend`
--
ALTER TABLE `lend`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `lend_log`
--
ALTER TABLE `lend_log`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `book`
--
ALTER TABLE `book`
  MODIFY `id` int(6) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=70;
--
-- AUTO_INCREMENT for table `lend`
--
ALTER TABLE `lend`
  MODIFY `id` int(6) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `lend_log`
--
ALTER TABLE `lend_log`
  MODIFY `id` int(8) NOT NULL AUTO_INCREMENT;
--
-- AUTO_INCREMENT for table `user`
--
ALTER TABLE `user`
  MODIFY `id` int(3) NOT NULL AUTO_INCREMENT;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
